Microchip-MPLAB-Harmony/net/apps/web_net_server_nvm_mpfs/firmware/src/config/pic32mz_das_sk/crypto/src/sha256.c
    int wc_Sha256FinalRaw(wc_Sha256* sha256, byte* hash)
    {
    #ifdef LITTLE_ENDIAN_ORDER
        word32 digest[WC_SHA256_DIGEST_SIZE / sizeof(word32)];
    #endif

        if (sha256 == NULL || hash == NULL) {
            return BAD_FUNC_ARG;
        }

    #ifdef LITTLE_ENDIAN_ORDER
        ByteReverseWords((word32*)digest, (word32*)sha256->digest,
                                                         WC_SHA256_DIGEST_SIZE);
        XMEMCPY(hash, digest, WC_SHA256_DIGEST_SIZE);
    #else
        XMEMCPY(hash, sha256->digest, WC_SHA256_DIGEST_SIZE);
    #endif

        return 0;
    }

    int wc_Sha256Final(wc_Sha256* sha256, byte* hash)
    {
        int ret;

        if (sha256 == NULL || hash == NULL) {
            return BAD_FUNC_ARG;
        }

    #if defined(WOLFSSL_ASYNC_CRYPT) && defined(WC_ASYNC_ENABLE_SHA256)
        if (sha256->asyncDev.marker == WOLFSSL_ASYNC_MARKER_SHA256) {
        #if defined(HAVE_INTEL_QA)
            return IntelQaSymSha256(&sha256->asyncDev, hash, NULL,
                                            WC_SHA256_DIGEST_SIZE);
        #endif
        }
    #endif /* WOLFSSL_ASYNC_CRYPT */

        ret = Sha256Final(sha256);
        if (ret != 0)
            return ret;

    #if defined(LITTLE_ENDIAN_ORDER)
        ByteReverseWords(sha256->digest, sha256->digest, WC_SHA256_DIGEST_SIZE);
    #endif
        XMEMCPY(hash, sha256->digest, WC_SHA256_DIGEST_SIZE);

        return InitSha256(sha256);  /* reset state */
    }

#endif /* XTRANSFORM */


#if defined(HAVE_INTEL_AVX1) || defined(HAVE_INTEL_AVX2)

#define _LOAD_DIGEST()                     \
    "movl	  (%[sha256]), %%r8d \n\t" \
    "movl	 4(%[sha256]), %%r9d \n\t" \
    "movl	 8(%[sha256]), %%r10d\n\t" \
    "movl	12(%[sha256]), %%r11d\n\t" \
    "movl	16(%[sha256]), %%r12d\n\t" \
    "movl	20(%[sha256]), %%r13d\n\t" \
    "movl	24(%[sha256]), %%r14d\n\t" \
    "movl	28(%[sha256]), %%r15d\n\t"

#define _STORE_ADD_DIGEST()                \
    "addl	%%r8d ,   (%[sha256])\n\t" \
    "addl	%%r9d ,  4(%[sha256])\n\t" \
    "addl	%%r10d,  8(%[sha256])\n\t" \
    "addl	%%r11d, 12(%[sha256])\n\t" \
    "addl	%%r12d, 16(%[sha256])\n\t" \
    "addl	%%r13d, 20(%[sha256])\n\t" \
    "addl	%%r14d, 24(%[sha256])\n\t" \
    "addl	%%r15d, 28(%[sha256])\n\t"

#define _ADD_DIGEST()                      \
    "addl	  (%[sha256]), %%r8d \n\t" \
    "addl	 4(%[sha256]), %%r9d \n\t" \
    "addl	 8(%[sha256]), %%r10d\n\t" \
    "addl	12(%[sha256]), %%r11d\n\t" \
    "addl	16(%[sha256]), %%r12d\n\t" \
    "addl	20(%[sha256]), %%r13d\n\t" \
    "addl	24(%[sha256]), %%r14d\n\t" \
    "addl	28(%[sha256]), %%r15d\n\t"

#define _STORE_DIGEST()                    \
    "movl	%%r8d ,   (%[sha256])\n\t" \
    "movl	%%r9d ,  4(%[sha256])\n\t" \
    "movl	%%r10d,  8(%[sha256])\n\t" \
    "movl	%%r11d, 12(%[sha256])\n\t" \
    "movl	%%r12d, 16(%[sha256])\n\t" \
    "movl	%%r13d, 20(%[sha256])\n\t" \
    "movl	%%r14d, 24(%[sha256])\n\t" \
    "movl	%%r15d, 28(%[sha256])\n\t"

#define LOAD_DIGEST() \
    _LOAD_DIGEST()

#define STORE_ADD_DIGEST() \
    _STORE_ADD_DIGEST()

#define ADD_DIGEST() \
    _ADD_DIGEST()

#define STORE_DIGEST() \
    _STORE_DIGEST()


#define S_0 %r8d
#define S_1 %r9d
#define S_2 %r10d
#define S_3 %r11d
#define S_4 %r12d
#define S_5 %r13d
#define S_6 %r14d
#define S_7 %r15d

#define L1  "%%edx"
#define L2  "%%ecx"
#define L3  "%%eax"
#define L4  "%%ebx"
#define WK  "%%rsp"

#define WORK_REGS  "eax", "ebx", "ecx", "edx"
#define STATE_REGS "r8","r9","r10","r11","r12","r13","r14","r15"
#define XMM_REGS   "xmm0", "xmm1", "xmm2", "xmm3", "xmm4", "xmm5", "xmm6",    \
                   "xmm7", "xmm8", "xmm9", "xmm10", "xmm11", "xmm12", "xmm13"

#if defined(HAVE_INTEL_RORX)
#define RND_STEP_RORX_0_1(a, b, c, d, e, f, g, h, i) \
    /* L3 = f */                                     \
    "movl	%" #f ", " L3 "\n\t"                 \
    /* L2 = e>>>11 */                                \
    "rorx	$11, %" #e ", " L2 "\n\t"            \
    /* h += w_k */                                   \
    "addl	(" #i ")*4(" WK "), %" #h "\n\t"     \

#define RND_STEP_RORX_0_2(a, b, c, d, e, f, g, h, i) \
    /* L2 = (e>>>6) ^ (e>>>11) */                    \
    "xorl	" L1 ", " L2 "\n\t"                  \
    /* L3 = f ^ g */                                 \
    "xorl	%" #g ", " L3 "\n\t"                 \
    /* L1 = e>>>25 */                                \
    "rorx	$25, %" #e ", " L1 "\n\t"            \

#define RND_STEP_RORX_0_3(a, b, c, d, e, f, g, h, i) \
    /* L3 = (f ^ g) & e */                           \
    "andl	%" #e ", " L3 "\n\t"                 \
    /* L1 = Sigma1(e) */                             \
    "xorl	" L2 ", " L1 "\n\t"                  \
    /* L2 = a>>>13 */                                \
    "rorx	$13, %" #a ", " L2 "\n\t"            \

#define RND_STEP_RORX_0_4(a, b, c, d, e, f, g, h, i) \
    /* h += Sigma1(e) */                             \
    "addl	" L1 ", %" #h "\n\t"                 \
    /* L1 = a>>>2 */                                 \
    "rorx	$2, %" #a ", " L1 "\n\t"             \
    /* L3 = Ch(e,f,g) */                             \
    "xorl	%" #g ", " L3 "\n\t"                 \

#define RND_STEP_RORX_0_5(a, b, c, d, e, f, g, h, i) \
    /* L2 = (a>>>2) ^ (a>>>13) */                    \
    "xorl	" L1 ", " L2 "\n\t"                  \
    /* L1 = a>>>22 */                                \
    "rorx	$22, %" #a ", " L1 "\n\t"            \
    /* h += Ch(e,f,g) */                             \
    "addl	" L3 ", %" #h "\n\t"                 \

#define RND_STEP_RORX_0_6(a, b, c, d, e, f, g, h, i) \
    /* L1 = Sigma0(a) */                             \
    "xorl	" L2 ", " L1 "\n\t"                  \
    /* L3 = b */                                     \
    "movl	%" #b ", " L3 "\n\t"                 \
    /* d += h + w_k + Sigma1(e) + Ch(e,f,g) */       \
    "addl	%" #h ", %" #d "\n\t"                \

#define RND_STEP_RORX_0_7(a, b, c, d, e, f, g, h, i) \
    /* L3 = a ^ b */                                 \
    "xorl	%" #a ", " L3 "\n\t"                 \
    /* h += Sigma0(a) */                             \
    "addl	" L1 ", %" #h "\n\t"                 \
    /* L4 = (a ^ b) & (b ^ c) */                     \
    "andl	" L3 ", " L4 "\n\t"                  \

