Microchip-MPLAB-Harmony/net/apps/web_net_server_nvm_mpfs/firmware/src/config/pic32mz_das_sk/crypto/src/sha256.c
#define RND_STEP_RORX_0_8(a, b, c, d, e, f, g, h, i) \
    /* L4 = Maj(a,b,c) */                            \
    "xorl	%" #b ", " L4 "\n\t"                 \
    /* L1 = d>>>6 (= e>>>6 next RND) */              \
    "rorx	$6, %" #d ", " L1 "\n\t"             \
    /* h += Maj(a,b,c) */                            \
    "addl	" L4 ", %" #h "\n\t"                 \

#define RND_STEP_RORX_1_1(a, b, c, d, e, f, g, h, i) \
    /* L4 = f */                                     \
    "movl	%" #f ", " L4 "\n\t"                 \
    /* L2 = e>>>11 */                                \
    "rorx	$11, %" #e ", " L2 "\n\t"            \
    /* h += w_k */                                   \
    "addl	(" #i ")*4(" WK "), %" #h "\n\t"     \

#define RND_STEP_RORX_1_2(a, b, c, d, e, f, g, h, i) \
    /* L2 = (e>>>6) ^ (e>>>11) */                    \
    "xorl	" L1 ", " L2 "\n\t"                  \
    /* L4 = f ^ g */                                 \
    "xorl	%" #g ", " L4 "\n\t"                 \
    /* L1 = e>>>25 */                                \
    "rorx	$25, %" #e ", " L1 "\n\t"            \

#define RND_STEP_RORX_1_3(a, b, c, d, e, f, g, h, i) \
    /* L4 = (f ^ g) & e */                           \
    "andl	%" #e ", " L4 "\n\t"                 \
    /* L1 = Sigma1(e) */                             \
    "xorl	" L2 ", " L1 "\n\t"                  \
    /* L2 = a>>>13 */                                \
    "rorx	$13, %" #a ", " L2 "\n\t"            \

#define RND_STEP_RORX_1_4(a, b, c, d, e, f, g, h, i) \
    /* h += Sigma1(e) */                             \
    "addl	" L1 ", %" #h "\n\t"                 \
    /* L1 = a>>>2 */                                 \
    "rorx	$2, %" #a ", " L1 "\n\t"             \
    /* L4 = Ch(e,f,g) */                             \
    "xorl	%" #g ", " L4 "\n\t"                 \

#define RND_STEP_RORX_1_5(a, b, c, d, e, f, g, h, i) \
    /* L2 = (a>>>2) ^ (a>>>13) */                    \
    "xorl	" L1 ", " L2 "\n\t"                  \
    /* L1 = a>>>22 */                                \
    "rorx	$22, %" #a ", " L1 "\n\t"            \
    /* h += Ch(e,f,g) */                             \
    "addl	" L4 ", %" #h "\n\t"                 \

#define RND_STEP_RORX_1_6(a, b, c, d, e, f, g, h, i) \
    /* L1 = Sigma0(a) */                             \
    "xorl	" L2 ", " L1 "\n\t"                  \
    /* L4 = b */                                     \
    "movl	%" #b ", " L4 "\n\t"                 \
    /* d += h + w_k + Sigma1(e) + Ch(e,f,g) */       \
    "addl	%" #h ", %" #d "\n\t"                \

#define RND_STEP_RORX_1_7(a, b, c, d, e, f, g, h, i) \
    /* L4 = a ^ b */                                 \
    "xorl	%" #a ", " L4 "\n\t"                 \
    /* h += Sigma0(a) */                             \
    "addl	" L1 ", %" #h "\n\t"                 \
    /* L3 = (a ^ b) & (b ^ c) */                     \
    "andl	" L4 ", " L3 "\n\t"                  \

#define RND_STEP_RORX_1_8(a, b, c, d, e, f, g, h, i) \
    /* L3 = Maj(a,b,c) */                            \
    "xorl	%" #b ", " L3 "\n\t"                 \
    /* L1 = d>>>6 (= e>>>6 next RND) */              \
    "rorx	$6, %" #d ", " L1 "\n\t"             \
    /* h += Maj(a,b,c) */                            \
    "addl	" L3 ", %" #h "\n\t"                 \

#define _RND_RORX_X_0(a, b, c, d, e, f, g, h, i)     \
    /* L1 = e>>>6 */                                 \
    "rorx	$6, %" #e ", " L1 "\n\t"             \
    /* L2 = e>>>11 */                                \
    "rorx	$11, %" #e ", " L2 "\n\t"            \
    /* Prev RND: h += Maj(a,b,c) */                  \
    "addl	" L3 ", %" #a "\n\t"                 \
    /* h += w_k */                                   \
    "addl	(" #i ")*4(" WK "), %" #h "\n\t"     \
    /* L3 = f */                                     \
    "movl	%" #f ", " L3 "\n\t"                 \
    /* L2 = (e>>>6) ^ (e>>>11) */                    \
    "xorl	" L1 ", " L2 "\n\t"                  \
    /* L3 = f ^ g */                                 \
    "xorl	%" #g ", " L3 "\n\t"                 \
    /* L1 = e>>>25 */                                \
    "rorx	$25, %" #e ", " L1 "\n\t"            \
    /* L1 = Sigma1(e) */                             \
    "xorl	" L2 ", " L1 "\n\t"                  \
    /* L3 = (f ^ g) & e */                           \
    "andl	%" #e ", " L3 "\n\t"                 \
    /* h += Sigma1(e) */                             \
    "addl	" L1 ", %" #h "\n\t"                 \
    /* L1 = a>>>2 */                                 \
    "rorx	$2, %" #a ", " L1 "\n\t"             \
    /* L2 = a>>>13 */                                \
    "rorx	$13, %" #a ", " L2 "\n\t"            \
    /* L3 = Ch(e,f,g) */                             \
    "xorl	%" #g ", " L3 "\n\t"                 \
    /* L2 = (a>>>2) ^ (a>>>13) */                    \
    "xorl	" L1 ", " L2 "\n\t"                  \
    /* L1 = a>>>22 */                                \
    "rorx	$22, %" #a ", " L1 "\n\t"            \
    /* h += Ch(e,f,g) */                             \
    "addl	" L3 ", %" #h "\n\t"                 \
    /* L1 = Sigma0(a) */                             \
    "xorl	" L2 ", " L1 "\n\t"                  \
    /* L3 = b */                                     \
    "movl	%" #b ", " L3 "\n\t"                 \
    /* d += h + w_k + Sigma1(e) + Ch(e,f,g) */       \
    "addl	%" #h ", %" #d "\n\t"                \
    /* L3 = a ^ b */                                 \
    "xorl	%" #a ", " L3 "\n\t"                 \
    /* L4 = (a ^ b) & (b ^ c) */                     \
    "andl	" L3 ", " L4 "\n\t"                  \
    /* h += Sigma0(a) */                             \
    "addl	" L1 ", %" #h "\n\t"                 \
    /* L4 = Maj(a,b,c) */                            \
    "xorl	%" #b ", " L4 "\n\t"                 \

#define _RND_RORX_X_1(a, b, c, d, e, f, g, h, i)     \
    /* L1 = e>>>6 */                                 \
    "rorx	$6, %" #e ", " L1 "\n\t"             \
    /* L2 = e>>>11 */                                \
    "rorx	$11, %" #e ", " L2 "\n\t"            \
    /* Prev RND: h += Maj(a,b,c) */                  \
    "addl	" L4 ", %" #a "\n\t"                 \
    /* h += w_k */                                   \
    "addl	(" #i ")*4(" WK "), %" #h "\n\t"     \
    /* L4 = f */                                     \
    "movl	%" #f ", " L4 "\n\t"                 \
    /* L2 = (e>>>6) ^ (e>>>11) */                    \
    "xorl	" L1 ", " L2 "\n\t"                  \
    /* L4 = f ^ g */                                 \
    "xorl	%" #g ", " L4 "\n\t"                 \
    /* L1 = e>>>25 */                                \
    "rorx	$25, %" #e ", " L1 "\n\t"            \
    /* L1 = Sigma1(e) */                             \
    "xorl	" L2 ", " L1 "\n\t"                  \
    /* L4 = (f ^ g) & e */                           \
    "andl	%" #e ", " L4 "\n\t"                 \
    /* h += Sigma1(e) */                             \
    "addl	" L1 ", %" #h "\n\t"                 \
    /* L1 = a>>>2 */                                 \
    "rorx	$2, %" #a ", " L1 "\n\t"             \
    /* L2 = a>>>13 */                                \
    "rorx	$13, %" #a ", " L2 "\n\t"            \
    /* L4 = Ch(e,f,g) */                             \
    "xorl	%" #g ", " L4 "\n\t"                 \
    /* L2 = (a>>>2) ^ (a>>>13) */                    \
    "xorl	" L1 ", " L2 "\n\t"                  \
    /* L1 = a>>>22 */                                \
    "rorx	$22, %" #a ", " L1 "\n\t"            \
    /* h += Ch(e,f,g) */                             \
    "addl	" L4 ", %" #h "\n\t"                 \
    /* L1 = Sigma0(a) */                             \
    "xorl	" L2 ", " L1 "\n\t"                  \
    /* L4 = b */                                     \
    "movl	%" #b ", " L4 "\n\t"                 \
    /* d += h + w_k + Sigma1(e) + Ch(e,f,g) */       \
    "addl	%" #h ", %" #d "\n\t"                \
    /* L4 = a ^ b */                                 \
    "xorl	%" #a ", " L4 "\n\t"                 \
    /* L2 = (a ^ b) & (b ^ c) */                     \
    "andl	" L4 ", " L3 "\n\t"                  \
    /* h += Sigma0(a) */                             \
    "addl	" L1 ", %" #h "\n\t"                 \
    /* L3 = Maj(a,b,c) */                            \
    "xorl	%" #b ", " L3 "\n\t"                 \


#define RND_RORX_X_0(a,b,c,d,e,f,g,h,i) \
       _RND_RORX_X_0(a,b,c,d,e,f,g,h,i)
#define RND_RORX_X_1(a,b,c,d,e,f,g,h,i) \
       _RND_RORX_X_1(a,b,c,d,e,f,g,h,i)

#define RND_RORX_X4(a,b,c,d,e,f,g,h,i)    \
        RND_RORX_X_0(a,b,c,d,e,f,g,h,i+0) \
        RND_RORX_X_1(h,a,b,c,d,e,f,g,i+1) \
        RND_RORX_X_0(g,h,a,b,c,d,e,f,i+2) \
        RND_RORX_X_1(f,g,h,a,b,c,d,e,i+3)

