Microchip-MPLAB-Harmony/net/apps/web_net_server_nvm_mpfs/firmware/src/config/pic32mz_das_sk/crypto/src/sha256.c
#define RND_STEP_1_7(a,b,c,d,e,f,g,h,i)                               \
    /* L2 = ((a>>>9) ^ a) >>> 11 */                                   \
    "rorl	$11, " L2 "\n\t"                                      \
    /* d += h + w_k + Sigma1(e) + Ch(e,f,g) */                        \
    "addl	%" #h ", %" #d "\n\t"                                 \
    /* L2 = (((a>>>9) ^ a) >>> 11) ^ a */                             \
    "xorl	%" #a ", " L2 "\n\t"                                  \
    /* h = h + w_k + Sigma1(e) + Ch(e,f,g) + Maj(a,b,c) */            \
    "addl	" L3 ", %" #h "\n\t"                                  \

#define RND_STEP_1_8(a,b,c,d,e,f,g,h,i)                               \
    /* L2 = ((((a>>>9) ^ a) >>> 11) ^ a) >>> 2 */                     \
    "rorl	$2, " L2 "\n\t"                                       \
    /* L1 = d (e of next RND) */                                      \
    "movl	%" #d ", " L1 "\n\t"                                  \
    /* h = h + w_k + Sigma1(e) Sigma0(a) + Ch(e,f,g) + Maj(a,b,c) */  \
    "addl	" L2 ", %" #h "\n\t"                                  \

#define _RND_ALL_0(a,b,c,d,e,f,g,h,i)                                 \
    /* h += w_k */                                                    \
    "addl	(" #i ")*4(" WK "), %" #h "\n\t"                      \
    /* L2 = f */                                                      \
    "movl	%" #f ", " L2 "\n\t"                                  \
    /* L3 = b */                                                      \
    "movl	%" #b ", " L3 "\n\t"                                  \
    /* L2 = f ^ g */                                                  \
    "xorl	%" #g ", " L2 "\n\t"                                  \
    /* L1 = e>>>14 */                                                 \
    "rorl	$14, " L1 "\n\t"                                      \
    /* L2 = (f ^ g) & e */                                            \
    "andl	%" #e ", " L2 "\n\t"                                  \
    /* L1 = (e>>>14) ^ e */                                           \
    "xorl	%" #e ", " L1 "\n\t"                                  \
    /* L2 = Ch(e,f,g) */                                              \
    "xorl	%" #g ", " L2 "\n\t"                                  \
    /* L1 = ((e>>>14) ^ e) >>> 5 */                                   \
    "rorl	$5, " L1 "\n\t"                                       \
    /* h += Ch(e,f,g) */                                              \
    "addl	" L2 ", %" #h "\n\t"                                  \
    /* L1 = (((e>>>14) ^ e) >>> 5) ^ e */                             \
    "xorl	%" #e ", " L1 "\n\t"                                  \
    /* L3 = a ^ b */                                                  \
    "xorl	%" #a ", " L3 "\n\t"                                  \
    /* L1 = ((((e>>>14) ^ e) >>> 5) ^ e) >>> 6 */                     \
    "rorl	$6, " L1 "\n\t"                                       \
    /* L2 = a */                                                      \
    "movl	%" #a ", " L2 "\n\t"                                  \
    /* h = h + w_k + Sigma1(e) */                                     \
    "addl	" L1 ", %" #h "\n\t"                                  \
    /* L2 = a>>>9 */                                                  \
    "rorl	$9, " L2 "\n\t"                                       \
    /* L3 = (a ^ b) & (b ^ c) */                                      \
    "andl	" L3 ", " L4 "\n\t"                                   \
    /* L2 = (a>>>9) ^ a */                                            \
    "xorl	%" #a ", " L2 "\n\t"                                  \
    /* L1 = Maj(a,b,c) */                                             \
    "xorl	%" #b ", " L4 "\n\t"                                  \
    /* L2 = ((a>>>9) ^ a) >>> 11 */                                   \
    "rorl	$11, " L2 "\n\t"                                      \
    /* d += h + w_k + Sigma1(e) + Ch(e,f,g) */                        \
    "addl	%" #h ", %" #d "\n\t"                                 \
    /* L2 = (((a>>>9) ^ a) >>> 11) ^ a */                             \
    "xorl	%" #a ", " L2 "\n\t"                                  \
    /* h = h + w_k + Sigma1(e) + Ch(e,f,g) + Maj(a,b,c) */            \
    "addl	" L4 ", %" #h "\n\t"                                  \
    /* L2 = ((((a>>>9) ^ a) >>> 11) ^ a) >>> 2 */                     \
    "rorl	$2, " L2 "\n\t"                                       \
    /* L1 = d (e of next RND) */                                      \
    "movl	%" #d ", " L1 "\n\t"                                  \
    /* h = h + w_k + Sigma1(e) Sigma0(a) + Ch(e,f,g) + Maj(a,b,c) */  \
    "addl	" L2 ", %" #h "\n\t"                                  \

#define _RND_ALL_1(a,b,c,d,e,f,g,h,i)                                 \
    /* h += w_k */                                                    \
    "addl	(" #i ")*4(" WK "), %" #h "\n\t"                      \
    /* L2 = f */                                                      \
    "movl	%" #f ", " L2 "\n\t"                                  \
    /* L3 = b */                                                      \
    "movl	%" #b ", " L4 "\n\t"                                  \
    /* L2 = f ^ g */                                                  \
    "xorl	%" #g ", " L2 "\n\t"                                  \
    /* L1 = e>>>14 */                                                 \
    "rorl	$14, " L1 "\n\t"                                      \
    /* L2 = (f ^ g) & e */                                            \
    "andl	%" #e ", " L2 "\n\t"                                  \
    /* L1 = (e>>>14) ^ e */                                           \
    "xorl	%" #e ", " L1 "\n\t"                                  \
    /* L2 = Ch(e,f,g) */                                              \
    "xorl	%" #g ", " L2 "\n\t"                                  \
    /* L1 = ((e>>>14) ^ e) >>> 5 */                                   \
    "rorl	$5, " L1 "\n\t"                                       \
    /* h += Ch(e,f,g) */                                              \
    "addl	" L2 ", %" #h "\n\t"                                  \
    /* L1 = (((e>>>14) ^ e) >>> 5) ^ e */                             \
    "xorl	%" #e ", " L1 "\n\t"                                  \
    /* L3 = a ^ b */                                                  \
    "xorl	%" #a ", " L4 "\n\t"                                  \
    /* L1 = ((((e>>>14) ^ e) >>> 5) ^ e) >>> 6 */                     \
    "rorl	$6, " L1 "\n\t"                                       \
    /* L2 = a */                                                      \
    "movl	%" #a ", " L2 "\n\t"                                  \
    /* h = h + w_k + Sigma1(e) */                                     \
    "addl	" L1 ", %" #h "\n\t"                                  \
    /* L2 = a>>>9 */                                                  \
    "rorl	$9, " L2 "\n\t"                                       \
    /* L3 = (a ^ b) & (b ^ c)  */                                     \
    "andl	" L4 ", " L3 "\n\t"                                   \
    /* L2 = (a>>>9) ^ a */                                            \
    "xorl	%" #a", " L2 "\n\t"                                   \
    /* L1 = Maj(a,b,c) */                                             \
    "xorl	%" #b ", " L3 "\n\t"                                  \
    /* L2 = ((a>>>9) ^ a) >>> 11 */                                   \
    "rorl	$11, " L2 "\n\t"                                      \
    /* d += h + w_k + Sigma1(e) + Ch(e,f,g) */                        \
    "addl	%" #h ", %" #d "\n\t"                                 \
    /* L2 = (((a>>>9) ^ a) >>> 11) ^ a */                             \
    "xorl	%" #a ", " L2 "\n\t"                                  \
    /* h = h + w_k + Sigma1(e) + Ch(e,f,g) + Maj(a,b,c) */            \
    "addl	" L3 ", %" #h "\n\t"                                  \
    /* L2 = ((((a>>>9) ^ a) >>> 11) ^ a) >>> 2 */                     \
    "rorl	$2, " L2 "\n\t"                                       \
    /* L1 = d (e of next RND) */                                      \
    "movl	%" #d ", " L1 "\n\t"                                  \
    /* h = h + w_k + Sigma1(e) Sigma0(a) + Ch(e,f,g) + Maj(a,b,c) */  \
    "addl	" L2 ", %" #h "\n\t"                                  \


