Microchip-MPLAB-Harmony/net/apps/web_net_server_nvm_mpfs/firmware/src/config/pic32mz_das_sk/crypto/src/sha256.c
#define RND_ALL_0(a, b, c, d, e, f, g, h, i) \
       _RND_ALL_0(a, b, c, d, e, f, g, h, i)
#define RND_ALL_1(a, b, c, d, e, f, g, h, i) \
       _RND_ALL_1(a, b, c, d, e, f, g, h, i)

#define RND_ALL_4(a, b, c, d, e, f, g, h, i)   \
        RND_ALL_0(a, b, c, d, e, f, g, h, i+0) \
        RND_ALL_1(h, a, b, c, d, e, f, g, i+1) \
        RND_ALL_0(g, h, a, b, c, d, e, f, i+2) \
        RND_ALL_1(f, g, h, a, b, c, d, e, i+3)

#endif  /* defined(HAVE_INTEL_AVX1) ||  defined(HAVE_INTEL_AVX2) */

#if defined(HAVE_INTEL_AVX1) /* inline Assember for Intel AVX1 instructions */

#define _VPALIGNR(op1, op2, op3, op4)                    \
    "vpalignr	$" #op4", %" #op3", %" #op2", %" #op1"\n\t"
#define VPALIGNR(op1, op2, op3, op4)                     \
        _VPALIGNR(op1, op2, op3, op4)
#define _VPADDD(op1, op2, op3)                           \
    "vpaddd	%" #op3", %" #op2", %" #op1"\n\t"
#define VPADDD(op1, op2, op3)                            \
       _VPADDD(op1, op2, op3)
#define _VPSRLD(op1, op2, op3)                           \
    "vpsrld	$" #op3", %" #op2", %" #op1"\n\t"
#define VPSRLD(op1, op2, op3)        \
       _VPSRLD(op1, op2, op3)
#define _VPSRLQ(op1, op2, op3)                           \
    "vpsrlq	$" #op3", %" #op2", %" #op1"\n\t"
#define VPSRLQ(op1,op2,op3)        \
       _VPSRLQ(op1,op2,op3)
#define _VPSLLD(op1,op2,op3)                             \
    "vpslld	$" #op3", %" #op2", %" #op1"\n\t"
#define VPSLLD(op1,op2,op3)        \
       _VPSLLD(op1,op2,op3)
#define _VPOR(op1,op2,op3)                               \
    "vpor	%" #op3", %" #op2", %" #op1"\n\t"
#define VPOR(op1,op2,op3)          \
       _VPOR(op1,op2,op3)
#define _VPXOR(op1,op2,op3)                              \
    "vpxor	%" #op3", %" #op2", %" #op1"\n\t"
#define VPXOR(op1,op2,op3)         \
       _VPXOR(op1,op2,op3)
#define _VPSHUFD(op1,op2,op3)                            \
    "vpshufd	$" #op3", %" #op2", %" #op1"\n\t"
#define VPSHUFD(op1,op2,op3)       \
       _VPSHUFD(op1,op2,op3)
#define _VPSHUFB(op1,op2,op3)                            \
    "vpshufb	%" #op3", %" #op2", %" #op1"\n\t"
#define VPSHUFB(op1,op2,op3)       \
       _VPSHUFB(op1,op2,op3)
#define _VPSLLDQ(op1,op2,op3)                            \
    "vpslldq	$" #op3", %" #op2", %" #op1"\n\t"
#define VPSLLDQ(op1,op2,op3)       \
       _VPSLLDQ(op1,op2,op3)

#define MsgSched(X0,X1,X2,X3,a,b,c,d,e,f,g,h,_i)                           \
            RND_STEP_0_1(a,b,c,d,e,f,g,h,_i)                               \
    VPALIGNR (XTMP1, X1, X0, 4)    /* XTMP1 = W[-15] */                    \
    VPALIGNR (XTMP0, X3, X2, 4)    /* XTMP0 = W[-7] */                     \
            RND_STEP_0_2(a,b,c,d,e,f,g,h,_i)                               \
            RND_STEP_0_3(a,b,c,d,e,f,g,h,_i)                               \
    VPSRLD   (XTMP2, XTMP1, 7)     /* XTMP2 = W[-15] >> 7 */               \
    VPSLLD   (XTMP3, XTMP1, 25)    /* XTEMP3 = W[-15] << (32-7) */         \
            RND_STEP_0_4(a,b,c,d,e,f,g,h,_i)                               \
            RND_STEP_0_5(a,b,c,d,e,f,g,h,_i)                               \
    VPSRLD   (XTMP4, XTMP1, 18)    /* XTEMP4 = W[-15] >> 18 */             \
    VPSLLD   (XTMP5, XTMP1, 14)    /* XTEMP5 = W[-15] << (32-18) */        \
            RND_STEP_0_6(a,b,c,d,e,f,g,h,_i)                               \
            RND_STEP_0_7(a,b,c,d,e,f,g,h,_i)                               \
    VPOR     (XTMP2, XTMP3, XTMP2) /* XTMP2 = W[-15] >>> 7 */              \
    VPOR     (XTMP4, XTMP5, XTMP4) /* XTMP4 = W[-15] >>> 18 */             \
            RND_STEP_0_8(a,b,c,d,e,f,g,h,_i)                               \
            RND_STEP_1_1(h,a,b,c,d,e,f,g,_i+1)                             \
            RND_STEP_1_2(h,a,b,c,d,e,f,g,_i+1)                             \
    VPSRLD   (XTMP5, XTMP1, 3)     /* XTMP4 = W[-15] >> 3 */               \
    VPXOR    (XTMP2, XTMP4, XTMP2)                                         \
                          /* XTMP2 = W[-15] MY_ROR 7 ^ W[-15] MY_ROR 18 */ \
            RND_STEP_1_3(h,a,b,c,d,e,f,g,_i+1)                             \
            RND_STEP_1_4(h,a,b,c,d,e,f,g,_i+1)                             \
    VPXOR    (XTMP1, XTMP5, XTMP2)  /* XTMP1 = s0 */                       \
    VPSHUFD  (XTMP2, X3, 0b11111010)  /* XTMP2 = W[-2] {BBAA}*/            \
            RND_STEP_1_5(h,a,b,c,d,e,f,g,_i+1)                             \
            RND_STEP_1_6(h,a,b,c,d,e,f,g,_i+1)                             \
    VPSRLD   (XTMP4, XTMP2, 10)      /* XTMP4 = W[-2] >> 10 {BBAA} */      \
    VPSRLQ   (XTMP3, XTMP2, 19)      /* XTMP3 = W[-2] MY_ROR 19 {xBxA} */  \
            RND_STEP_1_7(h,a,b,c,d,e,f,g,_i+1)                             \
            RND_STEP_1_8(h,a,b,c,d,e,f,g,_i+1)                             \
            RND_STEP_0_1(g,h,a,b,c,d,e,f,_i+2)                             \
    VPSRLQ   (XTMP2, XTMP2, 17)      /* XTMP2 = W[-2] MY_ROR 17 {xBxA} */  \
    VPADDD   (XTMP0, XTMP0, X0)                                            \
            RND_STEP_0_2(g,h,a,b,c,d,e,f,_i+2)                             \
            RND_STEP_0_3(g,h,a,b,c,d,e,f,_i+2)                             \
            RND_STEP_0_4(g,h,a,b,c,d,e,f,_i+2)                             \
    VPXOR    (XTMP2, XTMP3, XTMP2)                                         \
    VPADDD   (XTMP0, XTMP0, XTMP1)  /* XTMP0 = W[-16] + W[-7] + s0 */      \
            RND_STEP_0_5(g,h,a,b,c,d,e,f,_i+2)                             \
    VPXOR    (XTMP4, XTMP4, XTMP2)   /* XTMP4 = s1 {xBxA} */               \
            RND_STEP_0_6(g,h,a,b,c,d,e,f,_i+2)                             \
    VPSHUFB  (XTMP4, XTMP4, SHUF_00BA)  /* XTMP4 = s1 {00BA} */            \
            RND_STEP_0_7(g,h,a,b,c,d,e,f,_i+2)                             \
    VPADDD   (XTMP0, XTMP0, XTMP4)  /* XTMP0 = {..., ..., W[1], W[0]} */   \
            RND_STEP_0_8(g,h,a,b,c,d,e,f,_i+2)                             \
            RND_STEP_1_1(f,g,h,a,b,c,d,e,_i+3)                             \
    VPSHUFD  (XTMP2, XTMP0, 0b01010000) /* XTMP2 = W[-2] {DDCC} */         \
            RND_STEP_1_2(f,g,h,a,b,c,d,e,_i+3)                             \
    VPSRLQ   (XTMP4, XTMP2, 17)      /* XTMP4 = W[-2] MY_ROR 17 {xDxC} */  \
    VPSRLQ   (XTMP3, XTMP2, 19)       /* XTMP3 = W[-2] MY_ROR 19 {xDxC} */ \
            RND_STEP_1_3(f,g,h,a,b,c,d,e,_i+3)                             \
            RND_STEP_1_4(f,g,h,a,b,c,d,e,_i+3)                             \
    VPSRLD   (XTMP5, XTMP2, 10)       /* XTMP5 = W[-2] >> 10 {DDCC} */     \
    VPXOR    (XTMP4, XTMP3, XTMP4)                                         \
            RND_STEP_1_5(f,g,h,a,b,c,d,e,_i+3)                             \
            RND_STEP_1_6(f,g,h,a,b,c,d,e,_i+3)                             \
    VPXOR    (XTMP5, XTMP4, XTMP5)   /* XTMP5 = s1 {xDxC} */               \
            RND_STEP_1_7(f,g,h,a,b,c,d,e,_i+3)                             \
    VPSHUFB  (XTMP5, XTMP5, SHUF_DC00) /* XTMP5 = s1 {DC00} */             \
            RND_STEP_1_8(f,g,h,a,b,c,d,e,_i+3)                             \
    VPADDD   (X0, XTMP5, XTMP0)      /* X0 = {W[3], W[2], W[1], W[0]} */

