Microchip-MPLAB-Harmony/net/apps/web_net_server_nvm_mpfs/firmware/src/config/pic32mz_das_sk/crypto/src/sha256.c
#if defined(HAVE_INTEL_RORX)

#define MsgSched_RORX(X0,X1,X2,X3,a,b,c,d,e,f,g,h,_i)                      \
            RND_STEP_RORX_0_1(a,b,c,d,e,f,g,h,_i)                          \
    VPALIGNR (XTMP0, X3, X2, 4)                                            \
    VPALIGNR (XTMP1, X1, X0, 4)   /* XTMP1 = W[-15] */                     \
            RND_STEP_RORX_0_2(a,b,c,d,e,f,g,h,_i)                          \
            RND_STEP_RORX_0_3(a,b,c,d,e,f,g,h,_i)                          \
    VPSRLD   (XTMP2, XTMP1, 7)                                             \
    VPSLLD   (XTMP3, XTMP1, 25) /* VPSLLD   (XTMP3, XTMP1, (32-7)) */      \
            RND_STEP_RORX_0_4(a,b,c,d,e,f,g,h,_i)                          \
            RND_STEP_RORX_0_5(a,b,c,d,e,f,g,h,_i)                          \
    VPSRLD   (XTMP4, XTMP1, 3)  /* XTMP4 = W[-15] >> 3 */                  \
    VPOR     (XTMP3, XTMP3, XTMP2)  /* XTMP1 = W[-15] MY_ROR 7 */          \
            RND_STEP_RORX_0_6(a,b,c,d,e,f,g,h,_i)                          \
            RND_STEP_RORX_0_7(a,b,c,d,e,f,g,h,_i)                          \
            RND_STEP_RORX_0_8(a,b,c,d,e,f,g,h,_i)                          \
                                                                           \
            RND_STEP_RORX_1_1(h,a,b,c,d,e,f,g,_i+1)                        \
    VPSRLD   (XTMP2, XTMP1,18)                                             \
            RND_STEP_RORX_1_2(h,a,b,c,d,e,f,g,_i+1)                        \
    VPSLLD   (XTMP1, XTMP1, 14) /* VPSLLD   (XTMP1, XTMP1, (32-18)) */     \
            RND_STEP_RORX_1_3(h,a,b,c,d,e,f,g,_i+1)                        \
    VPXOR    (XTMP3, XTMP3, XTMP1)                                         \
            RND_STEP_RORX_1_4(h,a,b,c,d,e,f,g,_i+1)                        \
    VPXOR    (XTMP3, XTMP3, XTMP2)                                         \
                          /* XTMP1 = W[-15] MY_ROR 7 ^ W[-15] MY_ROR 18 */ \
            RND_STEP_RORX_1_5(h,a,b,c,d,e,f,g,_i+1)                        \
    VPSHUFD  (XTMP2, X3, 0b11111010)  /* XTMP2 = W[-2] {BBAA}*/            \
            RND_STEP_RORX_1_6(h,a,b,c,d,e,f,g,_i+1)                        \
    VPXOR    (XTMP1, XTMP3, XTMP4)  /* XTMP1 = s0 */                       \
            RND_STEP_RORX_1_7(h,a,b,c,d,e,f,g,_i+1)                        \
    VPSRLD   (XTMP4, XTMP2, 10)      /* XTMP4 = W[-2] >> 10 {BBAA} */      \
            RND_STEP_RORX_1_8(h,a,b,c,d,e,f,g,_i+1)                        \
                                                                           \
            RND_STEP_RORX_0_1(g,h,a,b,c,d,e,f,_i+2)                        \
    VPSRLQ   (XTMP3, XTMP2, 19)      /* XTMP3 = W[-2] MY_ROR 19 {xBxA} */  \
            RND_STEP_RORX_0_2(g,h,a,b,c,d,e,f,_i+2)                        \
    VPSRLQ   (XTMP2, XTMP2, 17)      /* XTMP2 = W[-2] MY_ROR 17 {xBxA} */  \
    VPADDD   (XTMP0, XTMP0, X0)                                            \
            RND_STEP_RORX_0_3(g,h,a,b,c,d,e,f,_i+2)                        \
    VPADDD   (XTMP0, XTMP0, XTMP1)  /* XTMP0 = W[-16] + W[-7] + s0 */      \
            RND_STEP_RORX_0_4(g,h,a,b,c,d,e,f,_i+2)                        \
    VPXOR    (XTMP2, XTMP2, XTMP3)                                         \
            RND_STEP_RORX_0_5(g,h,a,b,c,d,e,f,_i+2)                        \
    VPXOR    (XTMP4, XTMP4, XTMP2)   /* XTMP4 = s1 {xBxA} */               \
            RND_STEP_RORX_0_6(g,h,a,b,c,d,e,f,_i+2)                        \
    VPSHUFB  (XTMP4, XTMP4, SHUF_00BA)  /* XTMP4 = s1 {00BA} */            \
            RND_STEP_RORX_0_7(g,h,a,b,c,d,e,f,_i+2)                        \
    VPADDD   (XTMP0, XTMP0, XTMP4)  /* XTMP0 = {..., ..., W[1], W[0]} */   \
            RND_STEP_RORX_0_8(g,h,a,b,c,d,e,f,_i+2)                        \
                                                                           \
            RND_STEP_RORX_1_1(f,g,h,a,b,c,d,e,_i+3)                        \
    VPSHUFD  (XTMP2, XTMP0, 0b01010000) /* XTMP2 = W[-2] {DDCC} */         \
            RND_STEP_RORX_1_2(f,g,h,a,b,c,d,e,_i+3)                        \
    VPSRLD   (XTMP5, XTMP2, 10)       /* XTMP5 = W[-2] >> 10 {DDCC} */     \
            RND_STEP_RORX_1_3(f,g,h,a,b,c,d,e,_i+3)                        \
    VPSRLQ   (XTMP3, XTMP2, 19)       /* XTMP3 = W[-2] MY_ROR 19 {xDxC} */ \
            RND_STEP_RORX_1_4(f,g,h,a,b,c,d,e,_i+3)                        \
    VPSRLQ   (XTMP2, XTMP2, 17)      /* XTMP2 = W[-2] MY_ROR 17 {xDxC} */  \
            RND_STEP_RORX_1_5(f,g,h,a,b,c,d,e,_i+3)                        \
    VPXOR    (XTMP2, XTMP2, XTMP3)                                         \
            RND_STEP_RORX_1_6(f,g,h,a,b,c,d,e,_i+3)                        \
    VPXOR    (XTMP5, XTMP5, XTMP2)   /* XTMP5 = s1 {xDxC} */               \
            RND_STEP_RORX_1_7(f,g,h,a,b,c,d,e,_i+3)                        \
    VPSHUFB  (XTMP5, XTMP5, SHUF_DC00) /* XTMP5 = s1 {DC00} */             \
            RND_STEP_RORX_1_8(f,g,h,a,b,c,d,e,_i+3)                        \
    VPADDD   (X0, XTMP5, XTMP0)      /* X0 = {W[3], W[2], W[1], W[0]} */

#endif /* HAVE_INTEL_RORX */


#define _W_K_from_buff(X0, X1, X2, X3, BYTE_FLIP_MASK) \
    "# X0, X1, X2, X3 = W[0..15]\n\t"                  \
    "vmovdqu	  (%%rax), %" #X0 "\n\t"               \
    "vmovdqu	16(%%rax), %" #X1 "\n\t"               \
    VPSHUFB(X0, X0, BYTE_FLIP_MASK)                    \
    VPSHUFB(X1, X1, BYTE_FLIP_MASK)                    \
    "vmovdqu	32(%%rax), %" #X2 "\n\t"               \
    "vmovdqu	48(%%rax), %" #X3 "\n\t"               \
    VPSHUFB(X2, X2, BYTE_FLIP_MASK)                    \
    VPSHUFB(X3, X3, BYTE_FLIP_MASK)

#define W_K_from_buff(X0, X1, X2, X3, BYTE_FLIP_MASK) \
       _W_K_from_buff(X0, X1, X2, X3, BYTE_FLIP_MASK)


#define _SET_W_K_XFER_4(i) \
    "vpaddd	(" #i "*4)+ 0+%[K], %%xmm0, %%xmm4\n\t"  \
    "vpaddd	(" #i "*4)+16+%[K], %%xmm1, %%xmm5\n\t"  \
    "vmovdqu	%%xmm4,   (" WK ")\n\t"                  \
    "vmovdqu	%%xmm5, 16(" WK ")\n\t"                  \
    "vpaddd	(" #i "*4)+32+%[K], %%xmm2, %%xmm6\n\t"  \
    "vpaddd	(" #i "*4)+48+%[K], %%xmm3, %%xmm7\n\t"  \
    "vmovdqu	%%xmm6, 32(" WK ")\n\t"                  \
    "vmovdqu	%%xmm7, 48(" WK ")\n\t"

