Microchip-MPLAB-Harmony/net/apps/web_net_server_nvm_mpfs/firmware/src/config/pic32mz_das_sk/crypto/src/sha256.c
#define SET_W_K_XFER_4(i) \
       _SET_W_K_XFER_4(i)


static const ALIGN32 word64 mSHUF_00BA[] =
    { 0x0b0a090803020100, 0xFFFFFFFFFFFFFFFF }; /* shuffle xBxA -> 00BA */
static const ALIGN32 word64 mSHUF_DC00[] =
    { 0xFFFFFFFFFFFFFFFF, 0x0b0a090803020100 }; /* shuffle xDxC -> DC00 */
static const ALIGN32 word64 mBYTE_FLIP_MASK[] =
    { 0x0405060700010203, 0x0c0d0e0f08090a0b };

#define _Init_Masks(mask1, mask2, mask3)       \
    "vmovdqa	%[FLIP], %" #mask1 "\n\t"      \
    "vmovdqa	%[SHUF00BA], %" #mask2 "\n\t"  \
    "vmovdqa	%[SHUFDC00], %" #mask3 "\n\t"

#define Init_Masks(BYTE_FLIP_MASK, SHUF_00BA, SHUF_DC00) \
       _Init_Masks(BYTE_FLIP_MASK, SHUF_00BA, SHUF_DC00)

#define X0 %xmm0
#define X1 %xmm1
#define X2 %xmm2
#define X3 %xmm3

#define XTMP0 %xmm4
#define XTMP1 %xmm5
#define XTMP2 %xmm6
#define XTMP3 %xmm7
#define XTMP4 %xmm8
#define XTMP5 %xmm9
#define XFER  %xmm10

#define SHUF_00BA   %xmm11 /* shuffle xBxA -> 00BA */
#define SHUF_DC00   %xmm12 /* shuffle xDxC -> DC00 */
#define BYTE_FLIP_MASK  %xmm13


SHA256_NOINLINE static int Transform_Sha256_AVX1(wc_Sha256* sha256)
{
    __asm__ __volatile__ (

        "subq	$64, %%rsp\n\t"

        "leaq	32(%[sha256]), %%rax\n\t"
    Init_Masks(BYTE_FLIP_MASK, SHUF_00BA, SHUF_DC00)
    LOAD_DIGEST()

    W_K_from_buff(X0, X1, X2, X3, BYTE_FLIP_MASK)

        "movl	%%r9d, " L4 "\n\t"
        "movl	%%r12d, " L1 "\n\t"
        "xorl	%%r10d, " L4 "\n\t"

    SET_W_K_XFER_4(0)
    MsgSched(X0, X1, X2, X3, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  0)
    MsgSched(X1, X2, X3, X0, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3,  4)
    MsgSched(X2, X3, X0, X1, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  8)
    MsgSched(X3, X0, X1, X2, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3, 12)

    SET_W_K_XFER_4(16)
    MsgSched(X0, X1, X2, X3, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  0)
    MsgSched(X1, X2, X3, X0, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3,  4)
    MsgSched(X2, X3, X0, X1, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  8)
    MsgSched(X3, X0, X1, X2, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3, 12)

    SET_W_K_XFER_4(32)
    MsgSched(X0, X1, X2, X3, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  0)
    MsgSched(X1, X2, X3, X0, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3,  4)
    MsgSched(X2, X3, X0, X1, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  8)
    MsgSched(X3, X0, X1, X2, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3, 12)

    SET_W_K_XFER_4(48)
    RND_ALL_4(S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  0)
    RND_ALL_4(S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3,  4)
    RND_ALL_4(S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  8)
    RND_ALL_4(S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3, 12)

    STORE_ADD_DIGEST()

        "addq	$64, %%rsp\n\t"

        :
        : [FLIP]     "m" (mBYTE_FLIP_MASK[0]),
          [SHUF00BA] "m" (mSHUF_00BA[0]),
          [SHUFDC00] "m" (mSHUF_DC00[0]),
          [sha256]   "r" (sha256),
          [K]        "m" (K)
        : WORK_REGS, STATE_REGS, XMM_REGS, "memory"
    );

    return 0;
}

SHA256_NOINLINE static int Transform_Sha256_AVX1_Len(wc_Sha256* sha256,
                                                     word32 len)
{
    __asm__ __volatile__ (

        "subq	$64, %%rsp\n\t"
        "movq	120(%[sha256]), %%rax\n\t"

    Init_Masks(BYTE_FLIP_MASK, SHUF_00BA, SHUF_DC00)
    LOAD_DIGEST()

        "# Start of loop processing a block\n"
        "1:\n\t"

    W_K_from_buff(X0, X1, X2, X3, BYTE_FLIP_MASK)

        "movl	%%r9d, " L4 "\n\t"
        "movl	%%r12d, " L1 "\n\t"
        "xorl	%%r10d, " L4 "\n\t"

    SET_W_K_XFER_4(0)
    MsgSched(X0, X1, X2, X3, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  0)
    MsgSched(X1, X2, X3, X0, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3,  4)
    MsgSched(X2, X3, X0, X1, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  8)
    MsgSched(X3, X0, X1, X2, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3, 12)

    SET_W_K_XFER_4(16)
    MsgSched(X0, X1, X2, X3, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  0)
    MsgSched(X1, X2, X3, X0, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3,  4)
    MsgSched(X2, X3, X0, X1, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  8)
    MsgSched(X3, X0, X1, X2, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3, 12)

    SET_W_K_XFER_4(32)
    MsgSched(X0, X1, X2, X3, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  0)
    MsgSched(X1, X2, X3, X0, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3,  4)
    MsgSched(X2, X3, X0, X1, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  8)
    MsgSched(X3, X0, X1, X2, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3, 12)

    SET_W_K_XFER_4(48)
    RND_ALL_4(S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  0)
    RND_ALL_4(S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3,  4)
    RND_ALL_4(S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  8)
    RND_ALL_4(S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3, 12)
        "movq	120(%[sha256]), %%rax\n\t"

    ADD_DIGEST()

        "addq	$64, %%rax\n\t"
        "subl	$64, %[len]\n\t"

    STORE_DIGEST()

        "movq	%%rax, 120(%[sha256])\n\t"
        "jnz	1b\n\t"

        "addq	$64, %%rsp\n\t"

        :
        : [FLIP]     "m" (mBYTE_FLIP_MASK[0]),
          [SHUF00BA] "m" (mSHUF_00BA[0]),
          [SHUFDC00] "m" (mSHUF_DC00[0]),
          [sha256]   "r" (sha256),
          [len]      "r" (len),
          [K]        "m" (K)
        : WORK_REGS, STATE_REGS, XMM_REGS, "memory"
    );

    return 0;
}
#endif  /* HAVE_INTEL_AVX1 */

#if defined(HAVE_INTEL_AVX2) && defined(HAVE_INTEL_RORX)
SHA256_NOINLINE static int Transform_Sha256_AVX1_RORX(wc_Sha256* sha256)
{
    __asm__ __volatile__ (

        "subq	$64, %%rsp\n\t"

    Init_Masks(BYTE_FLIP_MASK, SHUF_00BA, SHUF_DC00)
        "leaq	32(%[sha256]), %%rax\n\t"
    W_K_from_buff(X0, X1, X2, X3, BYTE_FLIP_MASK)

    LOAD_DIGEST()

    SET_W_K_XFER_4(0)
        "movl	%%r9d, " L4 "\n\t"
        "rorx	$6, %%r12d, " L1 "\n\t"
        "xorl	%%r10d, " L4 "\n\t"
    MsgSched_RORX(X0, X1, X2, X3, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  0)
    MsgSched_RORX(X1, X2, X3, X0, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3,  4)
    MsgSched_RORX(X2, X3, X0, X1, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  8)
    MsgSched_RORX(X3, X0, X1, X2, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3, 12)

    SET_W_K_XFER_4(16)
    MsgSched_RORX(X0, X1, X2, X3, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  0)
    MsgSched_RORX(X1, X2, X3, X0, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3,  4)
    MsgSched_RORX(X2, X3, X0, X1, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  8)
    MsgSched_RORX(X3, X0, X1, X2, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3, 12)

    SET_W_K_XFER_4(32)
    MsgSched_RORX(X0, X1, X2, X3, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  0)
    MsgSched_RORX(X1, X2, X3, X0, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3,  4)
    MsgSched_RORX(X2, X3, X0, X1, S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  8)
    MsgSched_RORX(X3, X0, X1, X2, S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3, 12)

    SET_W_K_XFER_4(48)
        "xorl	" L3 ", " L3 "\n\t"
    RND_RORX_X4(S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  0)
    RND_RORX_X4(S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3,  4)
    RND_RORX_X4(S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7,  8)
    RND_RORX_X4(S_4, S_5, S_6, S_7, S_0, S_1, S_2, S_3, 12)
        /* Prev RND: h += Maj(a,b,c) */
        "addl	" L3 ", %%r8d\n\t"

    STORE_ADD_DIGEST()

        "addq	$64, %%rsp\n\t"

        :
        : [FLIP]     "m" (mBYTE_FLIP_MASK[0]),
          [SHUF00BA] "m" (mSHUF_00BA[0]),
          [SHUFDC00] "m" (mSHUF_DC00[0]),
          [sha256]   "r" (sha256),
          [K]        "m" (K)
        : WORK_REGS, STATE_REGS, XMM_REGS, "memory"
    );

