Microchip-MPLAB-Harmony/net/apps/web_net_server_nvm_mpfs/firmware/src/config/pic32mz_das_sk/crypto/src/sha256.c
#if defined(HAVE_INTEL_RORX)

#define MsgSched_Y_RORX(Y0,Y1,Y2,Y3,a,b,c,d,e,f,g,h,_i)                       \
            RND_STEP_RORX_0_1(a,b,c,d,e,f,g,h,_i)                             \
    VPALIGNR (YTMP1, Y1, Y0, 4)    /* YTMP1 = W[-15] */                       \
            RND_STEP_RORX_0_2(a,b,c,d,e,f,g,h,_i)                             \
    VPALIGNR (YTMP0, Y3, Y2, 4)    /* YTMP0 = W[-7] */                        \
            RND_STEP_RORX_0_3(a,b,c,d,e,f,g,h,_i)                             \
    VPSRLD   (YTMP2, YTMP1, 7)     /* YTMP2 = W[-15] >> 7 */                  \
            RND_STEP_RORX_0_4(a,b,c,d,e,f,g,h,_i)                             \
    VPSLLD   (YTMP3, YTMP1, 25)    /* YTEMP3 = W[-15] << (32-7) */            \
            RND_STEP_RORX_0_5(a,b,c,d,e,f,g,h,_i)                             \
    VPSRLD   (YTMP4, YTMP1, 18)    /* YTEMP4 = W[-15] >> 18 */                \
            RND_STEP_RORX_0_6(a,b,c,d,e,f,g,h,_i)                             \
    VPSLLD   (YTMP5, YTMP1, 14)    /* YTEMP5 = W[-15] << (32-18) */           \
            RND_STEP_RORX_0_7(a,b,c,d,e,f,g,h,_i)                             \
    VPOR     (YTMP2, YTMP2, YTMP3) /* YTMP2 = W[-15] >>> 7 */                 \
            RND_STEP_RORX_0_8(a,b,c,d,e,f,g,h,_i)                             \
    VPOR     (YTMP4, YTMP4, YTMP5) /* YTMP4 = W[-15] >>> 18 */                \
            RND_STEP_RORX_1_1(h,a,b,c,d,e,f,g,_i+1)                           \
    VPSRLD   (YTMP5, YTMP1, 3)     /* YTMP4 = W[-15] >> 3 */                  \
            RND_STEP_RORX_1_2(h,a,b,c,d,e,f,g,_i+1)                           \
    VPXOR    (YTMP2, YTMP2, YTMP4) /* YTMP2 = W[-15] >>> 7 ^ W[-15] >>> 18 */ \
            RND_STEP_RORX_1_3(h,a,b,c,d,e,f,g,_i+1)                           \
    VPSHUFD  (YTMP3, Y3, 0b11111010)  /* YTMP2 = W[-2] {BBAA}*/               \
            RND_STEP_RORX_1_4(h,a,b,c,d,e,f,g,_i+1)                           \
    VPXOR    (YTMP1, YTMP5, YTMP2)  /* YTMP1 = s0 */                          \
            RND_STEP_RORX_1_5(h,a,b,c,d,e,f,g,_i+1)                           \
    VPSRLD   (YTMP4, YTMP3, 10)      /* YTMP4 = W[-2] >> 10 {BBAA} */         \
            RND_STEP_RORX_1_6(h,a,b,c,d,e,f,g,_i+1)                           \
    VPSRLQ   (YTMP2, YTMP3, 19)      /* YTMP3 = W[-2] MY_ROR 19 {xBxA} */     \
            RND_STEP_RORX_1_7(h,a,b,c,d,e,f,g,_i+1)                           \
    VPSRLQ   (YTMP3, YTMP3, 17)      /* YTMP2 = W[-2] MY_ROR 17 {xBxA} */     \
            RND_STEP_RORX_1_8(h,a,b,c,d,e,f,g,_i+1)                           \
    VPADDD   (YTMP0, YTMP0, Y0)                                               \
            RND_STEP_RORX_0_1(g,h,a,b,c,d,e,f,_i+2)                           \
    VPXOR    (YTMP2, YTMP2, YTMP3)                                            \
            RND_STEP_RORX_0_2(g,h,a,b,c,d,e,f,_i+2)                           \
    VPXOR    (YTMP4, YTMP4, YTMP2)   /* YTMP4 = s1 {xBxA} */                  \
            RND_STEP_RORX_0_3(g,h,a,b,c,d,e,f,_i+2)                           \
    VPADDD   (YTMP0, YTMP0, YTMP1)  /* YTMP0 = W[-16] + W[-7] + s0 */         \
            RND_STEP_RORX_0_4(g,h,a,b,c,d,e,f,_i+2)                           \
    VPSHUFB  (YTMP4, YTMP4, SHUF_Y_00BA)  /* YTMP4 = s1 {00BA} */             \
            RND_STEP_RORX_0_5(g,h,a,b,c,d,e,f,_i+2)                           \
    VPADDD   (YTMP0, YTMP0, YTMP4)  /* YTMP0 = {..., ..., W[1], W[0]} */      \
            RND_STEP_RORX_0_6(g,h,a,b,c,d,e,f,_i+2)                           \
    VPSHUFD  (YTMP2, YTMP0, 0b01010000) /* YTMP2 = W[-2] {DDCC} */            \
            RND_STEP_RORX_0_7(g,h,a,b,c,d,e,f,_i+2)                           \
            RND_STEP_RORX_0_8(g,h,a,b,c,d,e,f,_i+2)                           \
    VPSRLQ   (YTMP4, YTMP2, 17)      /* YTMP4 = W[-2] MY_ROR 17 {xDxC} */     \
            RND_STEP_RORX_1_1(f,g,h,a,b,c,d,e,_i+3)                           \
    VPSRLQ   (YTMP3, YTMP2, 19)       /* YTMP3 = W[-2] MY_ROR 19 {xDxC} */    \
            RND_STEP_RORX_1_2(f,g,h,a,b,c,d,e,_i+3)                           \
    VPSRLD   (YTMP5, YTMP2, 10)       /* YTMP5 = W[-2] >> 10 {DDCC} */        \
            RND_STEP_RORX_1_3(f,g,h,a,b,c,d,e,_i+3)                           \
    VPXOR    (YTMP4, YTMP4, YTMP3)                                            \
            RND_STEP_RORX_1_4(f,g,h,a,b,c,d,e,_i+3)                           \
    VPXOR    (YTMP5, YTMP5, YTMP4)   /* YTMP5 = s1 {xDxC} */                  \
            RND_STEP_RORX_1_5(f,g,h,a,b,c,d,e,_i+3)                           \
            RND_STEP_RORX_1_6(f,g,h,a,b,c,d,e,_i+3)                           \
    VPSHUFB  (YTMP5, YTMP5, SHUF_Y_DC00) /* YTMP5 = s1 {DC00} */              \
            RND_STEP_RORX_1_7(f,g,h,a,b,c,d,e,_i+3)                           \
            RND_STEP_RORX_1_8(f,g,h,a,b,c,d,e,_i+3)                           \
    VPADDD   (Y0, YTMP5, YTMP0)      /* Y0 = {W[3], W[2], W[1], W[0]} */      \

#endif /* HAVE_INTEL_RORX */

#define _VINSERTI128(op1,op2,op3,op4) \
    "vinserti128	$" #op4 ", %" #op3 ", %" #op2 ", %" #op1 "\n\t"
#define VINSERTI128(op1,op2,op3,op4)  \
       _VINSERTI128(op1,op2,op3,op4)


#define _LOAD_W_K_LOW(BYTE_FLIP_MASK, reg)   \
    "# X0, X1, X2, X3 = W[0..15]\n\t"        \
    "vmovdqu	  (%%" #reg "), %%xmm0\n\t"  \
    "vmovdqu	16(%%" #reg "), %%xmm1\n\t"  \
    VPSHUFB(X0, X0, BYTE_FLIP_MASK)          \
    VPSHUFB(X1, X1, BYTE_FLIP_MASK)          \
    "vmovdqu	32(%%" #reg "), %%xmm2\n\t"  \
    "vmovdqu	48(%%" #reg "), %%xmm3\n\t"  \
    VPSHUFB(X2, X2, BYTE_FLIP_MASK)          \
    VPSHUFB(X3, X3, BYTE_FLIP_MASK)

#define LOAD_W_K_LOW(BYTE_FLIP_MASK, reg) \
       _LOAD_W_K_LOW(BYTE_FLIP_MASK, reg)


#define _LOAD_W_K(BYTE_FLIP_Y_MASK, reg)      \
    "# X0, X1, X2, X3 = W[0..15]\n\t"         \
    "vmovdqu	   (%%" #reg "), %%xmm0\n\t"  \
    "vmovdqu	 16(%%" #reg "), %%xmm1\n\t"  \
    "vmovdqu	 64(%%" #reg "), %%xmm4\n\t"  \
    "vmovdqu	 80(%%" #reg "), %%xmm5\n\t"  \
    VINSERTI128(Y0, Y0, XTMP0, 1)             \
    VINSERTI128(Y1, Y1, XTMP1, 1)             \
    VPSHUFB(Y0, Y0, BYTE_FLIP_Y_MASK)         \
    VPSHUFB(Y1, Y1, BYTE_FLIP_Y_MASK)         \
    "vmovdqu	 32(%%" #reg "), %%xmm2\n\t"  \
    "vmovdqu	 48(%%" #reg "), %%xmm3\n\t"  \
    "vmovdqu	 96(%%" #reg "), %%xmm6\n\t"  \
    "vmovdqu	112(%%" #reg "), %%xmm7\n\t"  \
    VINSERTI128(Y2, Y2, XTMP2, 1)             \
    VINSERTI128(Y3, Y3, XTMP3, 1)             \
    VPSHUFB(Y2, Y2, BYTE_FLIP_Y_MASK)         \
    VPSHUFB(Y3, Y3, BYTE_FLIP_Y_MASK)

